Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException Properties
The InvalidFilterExpressionException type exposes the following members.
Properties
Name | Description
Expression
 Gets the invalid expression.
InvalidFilterExpressionExceptionReasonsType
 Gets the reason why the exception is thrown.
LeftExpression
 Gets the invalid expression's left operand.
OperatorType
 Gets the invalid expression's operator.
RightExpression
 Gets the invalid expression's right operand.
Top
See Also
Reference
InvalidFilterExpressionException Class
Tekla.Structures.Filtering Namespace